rokudev/lt-sdk/lt/platforms/esp32/source/esp32/driver/flash/esp32/Esp32SPIFlash.c
/*******************************************************************************
 * platforms/esp32/source/esp32/driver/flash/esp32/Esp32SPIFlash.c
 *
 * This Source Code Form is subject to the terms of the Mozilla Public License, v. 2.0.
 * If a copy of the MPL was not distributed with this file, you can obtain one at
 * https://mozilla.org/MPL/2.0/.
 *
 * Copyright 2026 Roku Inc. All rights reserved.
 ******************************************************************************/

// Copyright 2015-2016 Espressif Systems (Shanghai) PTE LTD
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at

//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.
//
// Modified by Roku, Inc. Please see changelog below for more information.
//

#include <lt/LTTypes.h>
#include <lt/core/LTStdlib.h>
#include <lt/core/LTCore.h>

#include "Esp32_Registers.h"
#include "Esp32_Irq.h"
#include "Esp32_SoC.h"
#include "Esp32SPIFlash.h"
#include "FlashChipsCommands.h"
#include "Esp32SPIFlashCache.h"

DEFINE_LTLOG_SECTION("esp32.spiflash");

/*******************************************************************************
 * macros
*******************************************************************************/
#define BIT(n)                                      (1UL << (n))

/*******************************************************************************
 * consts
*******************************************************************************/
#define SPI1_R_QIO_ADDR_BITSLEN                     31
#define SPI1_R_QIO_DUMMY_CYCLELEN                   3
#define SPI1_R_DIO_ADDR_BITSLEN                     31
#define SPI1_R_FAST_ADDR_BITSLEN                    23
#define SPI1_R_FAST_DUMMY_CYCLELEN                  7
#define SPI1_R_SIO_ADDR_BITSLEN                     23

// the constants below are not from the ESP32 chip, but from the flash chip. If
// we end up supporting some other chip that doesn't support the same consts, then
// they will need to be abstracted into the chip specific structure
#define SPIFLASH_BYTES_LEN                      24
#define SPIFLASH_BUFF_BYTE_WRITE_NUM            32
#define SPIFLASH_BUFF_BYTE_READ_NUM             64
#define SPIFLASH_BP_MASK_ISSI                   (BIT(7) | BIT(5) | BIT(4) | BIT(3) | BIT(2))
#define SPIFLASH_W_SIO_ADDR_BITSLEN             23
#define SPIFLASH_QE                             BIT(9)

#define SPIFLASH_BUSY_FLAG                      BIT(0)
#define SPIFLASH_WRENABLE_FLAG                  BIT(1)
#define SPIFLASH_BP0                            BIT(2)
#define SPIFLASH_BP1                            BIT(3)
#define SPIFLASH_BP2                            BIT(4)
#define SPIFLASH_WR_PROTECT                     (SPIFLASH_BP0 | SPIFLASH_BP1 | SPIFLASH_BP2)

/*******************************************************************************
 * static variables
*******************************************************************************/
static const ESP32_MEM_REGION(DRAM) SPIFlashChipCommands * s_pChipCommands = NULL;

/*******************************************************************************
 * ROM
*******************************************************************************/
// ROM externs
extern u8 g_rom_spiflash_dummy_len_plus[];
// SPI flash chip in ROM
extern Esp32SPIFlash_Chip g_rom_spiflash_chip;
// ROM functions
extern int esp_rom_spiflash_read_user_cmd(u32 *status, u8 cmd);

/*******************************************************************************
 *
 * implementation
 *
*******************************************************************************/

static inline bool IsISSIChip(void) {
    return (((g_rom_spiflash_chip.deviceId >> 16) & 0xff) == 0x9D);
}

/*******************************************************************************
 * Initializes the driver by setting the chip commands structure
 * Returns a pointer to the flash chip
*******************************************************************************/
const Esp32SPIFlash_Chip * Esp32SPIFlash_Init(const char* pChipName) {
    s_pChipCommands = Esp32SPIFlash_GetChipCmds(pChipName);

#if 0
    esp_mspi_pin_init();

    /*
     * For Octal flash, it's hard to implement a read_id function in OPI mode for all vendors.
     *   So we have to read it here in SPI mode, before entering the OPI mode.
     */
    bootloader_flash_update_id();

    /*
     * This function initialise the Flash chip to the user-defined settings.
     *   In bootloader, we only init Flash (and MSPI) to a preliminary state, for being flexible to
     *   different chips. In this stage, we re-configure the Flash (and MSPI) to required configuration
     */
    spi_flash_init_chip_state();
#endif

    return (s_pChipCommands != NULL ? &g_rom_spiflash_chip : NULL);
}

/*******************************************************************************
 * Checks if the driver has been initialized
*******************************************************************************/
static bool Esp32SPIFlash_IsInited(void) {
    return (s_pChipCommands != NULL);
}

/*******************************************************************************
 * Runs the given command using the command register.
*******************************************************************************/
static bool ESP32_MEM_REGION(IRAM) Esp32SPIFlash_RunCmd(u32 cmd) {
    /* IRAM section begin - Code from here on must run from IRAM */
    ESP32_SPI1_REG(CMD) = cmd;
    volatile u16 timeout = LT_U16_MAX;
    while (ESP32_SPI1_REG(CMD) != 0 && --timeout != 0);

    return (ESP32_SPI1_REG(CMD) == 0);
    /* IRAM section continue - Code should keep running from IRAM until the flash access operation is completed */
}

