rokudev/lt-sdk/lt/platforms/esp32/source/esp32/driver/flash/esp32/Esp32SPIFlash.c
/*******************************************************************************
 * Read the chip status
 * @note this function waits for the flash to finish any running operation and
 * returns the status after the busy flag is cleared
*******************************************************************************/
static void ESP32_MEM_REGION(IRAM) Esp32SPIFlash_ReadStatus(u32 * pStatus) {
    u32 statusValue = SPIFLASH_BUSY_FLAG;

    /* IRAM section begin - Code from here on must run from IRAM */

    if (g_rom_spiflash_dummy_len_plus[1] == 0) {
        volatile u16 timeout = LT_U16_MAX;
        while (SPIFLASH_BUSY_FLAG == (statusValue & SPIFLASH_BUSY_FLAG) && --timeout != 0) {
            ESP32_SPI1_REG(RD_STATUS) = 0;

            Esp32SPIFlash_RunCmd(s_pChipCommands->RDSR);

            statusValue = ESP32_SPI1_REG(RD_STATUS) & (g_rom_spiflash_chip.statusMask);
        }
    } else {
        volatile u16 timeout = LT_U16_MAX;
        while (SPIFLASH_BUSY_FLAG == (statusValue & SPIFLASH_BUSY_FLAG) && --timeout != 0) {
            esp_rom_spiflash_read_user_cmd(&statusValue, s_pChipCommands->RDSRC);
        }
    }

    /* IRAM section end - Code from here on can run from flash */

    *pStatus = statusValue;
}

/*******************************************************************************
 * Waits for any previous actions to be completed.
*******************************************************************************/
static void ESP32_MEM_REGION(IRAM) Esp32SPIFlash_WaitForIdle(void) {
    volatile u16 timeout = LT_U16_MAX;

    /* IRAM section begin - Code from here on must run from IRAM */

    // wait for spi control ready
    while (ESP32_SPI1_REG(EXT2) & ESP32_REG_MASK(SPI_EXT2, SPI_ST) && --timeout != 0) {
    }
    timeout = LT_U16_MAX;
    while (ESP32_SPI0_REG(EXT2) & ESP32_REG_MASK(SPI_EXT2, SPI_ST) && --timeout != 0) {
    }

    u32 status = 0;
    Esp32SPIFlash_ReadStatus(&status);

    /* IRAM section end - Code from here on can run from flash */
}

/*******************************************************************************
 * Enable write. This is required before performing any operation that writes
 * to the flash including the status
*******************************************************************************/
static bool ESP32_MEM_REGION(IRAM)  Esp32SPIFlash_EnableWrite(void) {
    /* IRAM section begin - Code from here on must run from IRAM */

    Esp32SPIFlash_WaitForIdle();

    // enable write
    Esp32SPIFlash_RunCmd(s_pChipCommands->WREN);     // enable write operation
    // make sure the flash is ready for writing
    volatile u16 timeout = LT_U16_MAX;
    u32 status  = 0;
    while (SPIFLASH_WRENABLE_FLAG != (status & SPIFLASH_WRENABLE_FLAG) && --timeout != 0) {
        Esp32SPIFlash_ReadStatus(&status);
    }
    Esp32SPIFlash_WaitForIdle();

    /* IRAM section end - Code from here on can run from flash */

    return (timeout != 0);
}

/*******************************************************************************
 * Read two-byte status
*******************************************************************************/
static void ESP32_MEM_REGION(IRAM) Esp32SPIFlash_ReadStatusHigh(u32 * pStatus) {
    /* IRAM section begin - Code from here on must run from IRAM */
    Esp32SPIFlash_WaitForIdle();
    esp_rom_spiflash_read_user_cmd(pStatus, s_pChipCommands->RDSRCH);
    *pStatus = *pStatus << 8;
    /* IRAM section end - Code from here on can run from flash */
}

/*******************************************************************************
 * Write the given status to the chip
*******************************************************************************/
static void ESP32_MEM_REGION(IRAM) Esp32SPIFlash_WriteStatus(u32 statusValue) {
    /* IRAM section begin - Code from here on must run from IRAM */
    Esp32SPIFlash_WaitForIdle();
    ESP32_SPI1_REG(RD_STATUS) = statusValue;
    Esp32SPIFlash_RunCmd(s_pChipCommands->WRSR);
    Esp32SPIFlash_WaitForIdle();
    /* IRAM section end - Code from here on can run from flash */
}

/*******************************************************************************
 * Unlock the flash
 * The flash chips support protecting a range of blocks or predefined blocks, but
 * does not support specific individual blocks
*******************************************************************************/
bool ESP32_MEM_REGION(IRAM) Esp32SPIFlash_WriteUnprotect(void) {
    u32 status      = 0;
    u32 newStatus  = 0;

    if (!Esp32SPIFlash_IsInited()) {
        return false;
    }

    u32 mask = Esp32DisableInterrupts();

    /* IRAM section begin - Code from here on must run from IRAM */

    u32 state = Esp32SPIFlashCache_DisableCache();

    Esp32SPIFlash_WaitForIdle();

    if (IsISSIChip()) {
        Esp32SPIFlash_ReadStatus(&status);

        newStatus = status & (~SPIFLASH_BP_MASK_ISSI);
        ESP32_SPI1_REG(CTRL) &= ~ESP32_REG_MASK(SPI_CTRL, TWO_BYTES_STATUS_EN);
    } else {
        Esp32SPIFlash_ReadStatusHigh(&status);

        newStatus = status & SPIFLASH_QE;
        ESP32_SPI1_REG(CTRL) |= ESP32_REG_MASK(SPI_CTRL, TWO_BYTES_STATUS_EN);
    }

    // need to enable write to write to the status register
    bool bSuccess = Esp32SPIFlash_EnableWrite();
    if (bSuccess) {
        // set unlocked status
        Esp32SPIFlash_WriteStatus(newStatus);
        Esp32SPIFlash_WaitForIdle();
    }

    Esp32SPIFlashCache_EnableCache(state);

    /* IRAM section end - Code from here on can run from flash */

    Esp32EnableInterrupts(mask);

    return bSuccess;
}

/*******************************************************************************
 * Returns whether the flash is locked or unlock
*******************************************************************************/
bool ESP32_MEM_REGION(IRAM) Esp32SPIFlash_IsLocked(void) {
    u32 status = 0;

    if (!Esp32SPIFlash_IsInited()) {
        return false;
    }

    u32 mask = Esp32DisableInterrupts();

    /* IRAM section begin - Code from here on must run from IRAM */

