rokudev/lt-sdk/lt/platforms/esp32/source/esp32/driver/flash/esp32/Esp32SPIFlash.c
    u32 state = Esp32SPIFlashCache_DisableCache();

    if (IsISSIChip()) {
        Esp32SPIFlash_ReadStatus(&status);
    } else {
        Esp32SPIFlash_ReadStatusHigh(&status);
    }

    Esp32SPIFlashCache_EnableCache(state);

    /* IRAM section end - Code from here on can run from flash */

    Esp32EnableInterrupts(mask);

    return (status & SPIFLASH_WR_PROTECT);
}

/*******************************************************************************
 * Write to flash
  * Notes:
 *   addr must be 4-byte aligned
*******************************************************************************/
static bool ESP32_MEM_REGION(IRAM) Esp32SPIFlash_ProgramPage(u32 addr, u32 * pSrcAddr, u32 len) {
    // check 4byte alignment
    if (len & 0x3) {
        return false;
    }

    // check if write in one page
    if ((g_rom_spiflash_chip.pageSize) < ((addr % (g_rom_spiflash_chip.pageSize)) + len)) {
        return false;
    }

    u32 mask = Esp32DisableInterrupts();

    /* IRAM section begin - Code from here on must run from IRAM */

    u32 state = Esp32SPIFlashCache_DisableCache();

    // disable dummy writes as there's nothing to read
    ESP32_SPI1_REG(USER) &= ~ESP32_REG_MASK(SPI_USER, DUMMY);
    ESP32_SPI1_REG(USER1) = (ESP32_SPI1_REG(USER1) & ~ESP32_REG_MASK(SPI_USER1, ADDR_BITLEN)) |
                                     (SPIFLASH_W_SIO_ADDR_BITSLEN << ESP32_REG_SHIFT(SPI_USER1, ADDR_BITLEN));

    s32 sLen = len;
    bool bSuccess = true;
    while (sLen > 0 && bSuccess) {
        bSuccess = Esp32SPIFlash_EnableWrite();
        if (bSuccess) {
            if (sLen >= SPIFLASH_BUFF_BYTE_WRITE_NUM) {

                ESP32_SPI1_REG(ADDR) = (addr & 0xffffff) | ( SPIFLASH_BUFF_BYTE_WRITE_NUM << SPIFLASH_BYTES_LEN); // 32 byte a block

                for (u32 i = 0; i < (SPIFLASH_BUFF_BYTE_WRITE_NUM >> 2); ++i) {
                    ESP32_SPI_W_REG(SPI1, i) = *pSrcAddr++;
                }
                sLen -= 32;
                addr += 32;
            } else {
                ESP32_SPI1_REG(ADDR) = (addr & 0xffffff) | (sLen << SPIFLASH_BYTES_LEN);

                u8 remaining = ((sLen & 0x3) == 0) ? (sLen >> 2) : (sLen >> 2) + 1;
                for (u8 i = 0; i < remaining; ++i, ++pSrcAddr) {
                    ESP32_SPI_W_REG(SPI1, i) = *pSrcAddr;
                }
                sLen = 0;
            }
            Esp32SPIFlash_RunCmd(s_pChipCommands->PP);
            Esp32SPIFlash_WaitForIdle();
        }
    }

    Esp32SPIFlashCache_EnableCache(state);

    /* IRAM section end - Code from here on can run from flash */

    Esp32EnableInterrupts(mask);

    return bSuccess;
}

/*******************************************************************************
 * Lock the flash
*******************************************************************************/
bool ESP32_MEM_REGION(IRAM) Esp32SPIFlash_WriteProtect(void) {
    if (!Esp32SPIFlash_IsInited()) {
        return false;
    }

    u32 mask = Esp32DisableInterrupts();

    /* IRAM section begin - Code from here on must run from IRAM */

    u32 state = Esp32SPIFlashCache_DisableCache();

    u32 status = 0;
    Esp32SPIFlash_ReadStatusHigh(&status);
    // enable 2 byte status writing
    ESP32_SPI1_REG(CTRL) |= ESP32_REG_MASK(SPI_CTRL, TWO_BYTES_STATUS_EN);

    bool bSuccess = Esp32SPIFlash_EnableWrite();
    if (bSuccess) {
        Esp32SPIFlash_WriteStatus(status | SPIFLASH_WR_PROTECT);
    }

    Esp32SPIFlashCache_EnableCache(state);

    /* IRAM section end - Code from here on can run from flash */

    Esp32EnableInterrupts(mask);

    return bSuccess;
}

/*******************************************************************************
 * erase the entire flash
*******************************************************************************/
bool ESP32_MEM_REGION(IRAM) Esp32SPIFlash_EraseChip(void) {
    if (!Esp32SPIFlash_IsInited()) {
        return false;
    }

    u32 mask = Esp32DisableInterrupts();

    /* IRAM section begin - Code from here on must run from IRAM */

    u32 state = Esp32SPIFlashCache_DisableCache();

    bool bSuccess = Esp32SPIFlash_EnableWrite();

    if (bSuccess) {
        Esp32SPIFlash_RunCmd(s_pChipCommands->CE);
        Esp32SPIFlash_WaitForIdle();
    }

    Esp32SPIFlashCache_EnableCache(state);

    /* IRAM section end - Code from here on can run from flash */

    Esp32EnableInterrupts(mask);

    return bSuccess;
}

/*******************************************************************************
 * erase a block
*******************************************************************************/
bool ESP32_MEM_REGION(IRAM) Esp32SPIFlash_EraseBlock(u32 blockNum) {
    if (!Esp32SPIFlash_IsInited()) {
        return false;
    }

    if (blockNum >= ((g_rom_spiflash_chip.chipSize) / (g_rom_spiflash_chip.blockSize))) {
        return false;
    }

    u32 mask = Esp32DisableInterrupts();

    /* IRAM section begin - Code from here on must run from IRAM */

    u32 state = Esp32SPIFlashCache_DisableCache();

    bool bSuccess = Esp32SPIFlash_EnableWrite();

    if (bSuccess) {
        // disable dummy writes as there's nothing to read
        ESP32_SPI1_REG(USER) &= ~ESP32_REG_MASK(SPI_USER, DUMMY);
        ESP32_SPI1_REG(USER1) = (ESP32_SPI1_REG(USER1) & ~ESP32_REG_MASK(SPI_USER1, ADDR_BITLEN)) |
                                        (SPIFLASH_W_SIO_ADDR_BITSLEN << ESP32_REG_SHIFT(SPI_USER1, ADDR_BITLEN));


        u32 addr = blockNum * g_rom_spiflash_chip.blockSize;
        ESP32_SPI1_REG(ADDR) = addr & 0xffffff;
        Esp32SPIFlash_RunCmd(s_pChipCommands->BE);
        Esp32SPIFlash_WaitForIdle();
    }
    Esp32SPIFlashCache_EnableCache(state);

    /* IRAM section end - Code from here on can run from flash */

    Esp32EnableInterrupts(mask);

    return true;
}

/*******************************************************************************
 * erase a sector
*******************************************************************************/
bool ESP32_MEM_REGION(IRAM) Esp32SPIFlash_EraseSector(u32 sectorNum) {
    if (!Esp32SPIFlash_IsInited()) {
        return false;
    }

    if (sectorNum >= ((g_rom_spiflash_chip.chipSize) / (g_rom_spiflash_chip.sectorSize))) {
        return false;
    }

    u32 mask = Esp32DisableInterrupts();

    /* IRAM section begin - Code from here on must run from IRAM */

