rokudev/lt-sdk/lt/platforms/esp32/source/esp32/driver/flash/esp32/Esp32SPIFlash.c
    u32 state = Esp32SPIFlashCache_DisableCache();

    bool bSuccess = Esp32SPIFlash_EnableWrite();
    if (bSuccess) {
        // disable dummy writes as there's nothing to read
        ESP32_SPI1_REG(USER) &= ~ESP32_REG_MASK(SPI_USER, DUMMY);
        ESP32_SPI1_REG(USER1) = (ESP32_SPI1_REG(USER1) & ~ESP32_REG_MASK(SPI_USER1, ADDR_BITLEN)) |
                                        (SPIFLASH_W_SIO_ADDR_BITSLEN << ESP32_REG_SHIFT(SPI_USER1, ADDR_BITLEN));

        u32 addr = sectorNum * g_rom_spiflash_chip.sectorSize;
        ESP32_SPI1_REG(ADDR) = addr & 0xffffff;
        Esp32SPIFlash_RunCmd(s_pChipCommands->SE);
        Esp32SPIFlash_WaitForIdle();
    }

    Esp32SPIFlashCache_EnableCache(state);

    /* IRAM section end - Code from here on can run from flash */

    Esp32EnableInterrupts(mask);

    return bSuccess;
}

/*******************************************************************************
 * write to flash. Chip must be unlocked and erased first
 * Notes:
 *   target must be 4-byte aligned
*******************************************************************************/
static bool Esp32SPIFlash_WritePriv(u32 target, const u8 * pBuffer, u32 len) {
    if (!Esp32SPIFlash_IsInited()) {
        return false;
    }

    // check program size
    if ((target + len) > (g_rom_spiflash_chip.chipSize)) {
        return false;
    }

    u32 pageSize = g_rom_spiflash_chip.pageSize;
    u32 progLen = pageSize - (target % pageSize);
    if (len < progLen) {
        if (!Esp32SPIFlash_ProgramPage(target, (u32 *)pBuffer, len)) {
            return false;
        }
    } else {
        if (!Esp32SPIFlash_ProgramPage(target, (u32 *)pBuffer, progLen)) {
            return false;
        }

        // whole page program
        u32 progNum = (len - progLen) / pageSize;
        for (u32 i = 0; i < progNum; i++) {
            if (!Esp32SPIFlash_ProgramPage(target + progLen, (u32 *)pBuffer + (progLen >> 2), pageSize)) {
                return false;
            }
            progLen += pageSize;
        }

        if (!Esp32SPIFlash_ProgramPage(target + progLen, (u32 *)pBuffer + (progLen >> 2), len - progLen)) {
            return false;
        }
    }
    return true;
}

/*******************************************************************************
 * Writes encrypted data to flash
 *   pData must be 32-byte aligned
 *   len must be 16-byte aligned
*******************************************************************************/
static bool ESP32_MEM_REGION(IRAM) Esp32SPIFlash_WriteEncrypted(u32 addr, const u8 * pData, u32 len) {
    if (!Esp32SPIFlash_IsInited()) {
        return false;
    }

    // check addr and len for alignment
    if ((addr & 0x1f) || (len & 0xf)) {
        return false;
    }

    u32 mask = Esp32DisableInterrupts();

    /* IRAM section begin - Code from here on must run from IRAM */

    u32 state = Esp32SPIFlashCache_DisableCache();

    // disable dummy writes as there's nothing to read
    ESP32_SPI1_REG(USER) &= ~ESP32_REG_MASK(SPI_USER, DUMMY);
    ESP32_SPI1_REG(USER1) = (ESP32_SPI1_REG(USER1) & ~ESP32_REG_MASK(SPI_USER1, ADDR_BITLEN)) |
                                     (SPIFLASH_W_SIO_ADDR_BITSLEN << ESP32_REG_SHIFT(SPI_USER1, ADDR_BITLEN));

    // enable encryption
    ESP32_REG(DPORT_SLAVE_SPI_CONFIG) |= ESP32_REG_MASK(DPORT_SPI_ENCRYPT, ENABLE);

    s32 lenLeft = len;
    bool bSuccess = true;
    for (u32 i = 0; lenLeft > 0 && bSuccess;) {
        // prepare encryption
        ESP32_REG(FLASH_ENCRYPT_ADDRESS) = addr;
        for (u8 x = 0; x < (SPIFLASH_BUFF_BYTE_WRITE_NUM >> 2) && i < len; ++x, i += 4) {
            ESP32_REG_ARRAY_VALUE(FLASH_ENCRYPT_BUFFER_0, x) = *(u32 *)&pData[i];
        }
        // start the encryption
        ESP32_REG(FLASH_ENCRYPT_START) = ESP32_REG_VAL(FLASH_ENCRYPT, START);
        // wait until done
        volatile u16 timeout = LT_U16_MAX;
        while (ESP32_REG(FLASH_ENCRYPT_DONE) == 0 && --timeout != 0);
        bSuccess = (timeout != 0);
        if (bSuccess) {
            // the data written to flash here is the encrypted data and not what's in pData
            bSuccess = Esp32SPIFlash_ProgramPage(addr, (u32 *)pData, LT_MIN((u32)lenLeft, (u32)SPIFLASH_BUFF_BYTE_WRITE_NUM));
            addr    += SPIFLASH_BUFF_BYTE_WRITE_NUM;
            lenLeft -= SPIFLASH_BUFF_BYTE_WRITE_NUM;
        }
    }

    // disable encryption
    ESP32_REG(DPORT_SLAVE_SPI_CONFIG) &= ~ESP32_REG_MASK(DPORT_SPI_ENCRYPT, ENABLE);

    Esp32SPIFlashCache_EnableCache(state);

    /* IRAM section end - Code from here on can run from flash */

    Esp32EnableInterrupts(mask);

    return bSuccess;
}

/*******************************************************************************
 * Sets up the SPI registers for a read operation.
 * @note this function must run from IRAM because the cache needs to be disabled
*******************************************************************************/
static void ESP32_MEM_REGION(IRAM) Esp32SPIFlash_ReadDirect(u32 addr, u8 * pBuffer, u32 len) {

    u32 mask = Esp32DisableInterrupts();

    /* IRAM section begin - Code from here on must run from IRAM */

    u32 state = Esp32SPIFlashCache_DisableCache();

    // QIO or SIO, non-QIO regard as SIO
    u32 modeBits        = ESP32_SPI1_REG(CTRL);
    bool qIOMode        = modeBits & ESP32_REG_MASK(SPI_CTRL, SPI_FREAD_QIO);
    bool quadMode       = modeBits & ESP32_REG_MASK(SPI_CTRL, SPI_FREAD_QUAD);
    bool dIOMode        = modeBits & ESP32_REG_MASK(SPI_CTRL, SPI_FREAD_DIO);
    bool fastReadMode   = modeBits & ESP32_REG_MASK(SPI_CTRL, SPI_FASTRD_MODE);
    bool dualMode       = modeBits & ESP32_REG_MASK(SPI_CTRL, SPI_FREAD_DUAL);
    if (qIOMode && fastReadMode) {
        ESP32_SPI1_REG(USER) &= ~ESP32_REG_MASK(SPI_USER, MOSI);
        ESP32_SPI1_REG(USER) |= ESP32_REG_MASK(SPI_USER, MISO) | ESP32_REG_MASK(SPI_USER, DUMMY) | ESP32_REG_MASK(SPI_USER, ADDR);
        ESP32_SPI1_REG(USER1) = (ESP32_SPI1_REG(USER1) & ~ESP32_REG_MASK(SPI_USER1, ADDR_BITLEN)) |
                                         (SPI1_R_QIO_ADDR_BITSLEN << ESP32_REG_SHIFT(SPI_USER1, ADDR_BITLEN));
        ESP32_SPI1_REG(USER1) = (ESP32_SPI1_REG(USER1) & ~ESP32_REG_MASK(SPI_USER1, DUMMY_CYCLELEN)) |
                                         ((SPI1_R_QIO_DUMMY_CYCLELEN + g_rom_spiflash_dummy_len_plus[1]) << ESP32_REG_SHIFT(SPI_USER1, DUMMY_CYCLELEN));
        ESP32_SPI1_REG(USER2) = (0x7 << ESP32_REG_SHIFT(SPI_USER2, COMMAND_BITLEN)) | s_pChipCommands->FRQ;
    } else if (fastReadMode) {
        ESP32_SPI1_REG(USER) &= ~ESP32_REG_MASK(SPI_USER, MOSI);
        ESP32_SPI1_REG(USER) |=  ESP32_REG_MASK(SPI_USER, MISO) | ESP32_REG_MASK(SPI_USER, ADDR);
        if (dIOMode) {
            if (g_rom_spiflash_dummy_len_plus[1] == 0) {
                ESP32_SPI1_REG(USER) &= ~ESP32_REG_MASK(SPI_USER, DUMMY);
                ESP32_SPI1_REG(USER1) = (ESP32_SPI1_REG(USER1) & ~ESP32_REG_MASK(SPI_USER1, ADDR_BITLEN)) |
                                                 (SPI1_R_DIO_ADDR_BITSLEN << ESP32_REG_SHIFT(SPI_USER1, ADDR_BITLEN));
                ESP32_SPI1_REG(USER2) = (0x7 << ESP32_REG_SHIFT(SPI_USER2, COMMAND_BITLEN)) | s_pChipCommands->FRD;
            } else {
                ESP32_SPI1_REG(USER) |= ESP32_REG_MASK(SPI_USER, DUMMY);
                ESP32_SPI1_REG(USER1) = (ESP32_SPI1_REG(USER1) & ~ESP32_REG_MASK(SPI_USER1, ADDR_BITLEN)) |
                                                 (SPI1_R_DIO_ADDR_BITSLEN << ESP32_REG_SHIFT(SPI_USER1, ADDR_BITLEN));
                ESP32_SPI1_REG(USER1) = (ESP32_SPI1_REG(USER1) & ~ESP32_REG_MASK(SPI_USER1, DUMMY_CYCLELEN)) |
                                                 ((g_rom_spiflash_dummy_len_plus[1] - 1) << ESP32_REG_SHIFT(SPI_USER1, DUMMY_CYCLELEN));
                ESP32_SPI1_REG(USER2) = (ESP32_SPI1_REG(USER2) & ~ESP32_REG_MASK(SPI_USER2, COMMAND_VALUE)) |
                                                 (0xBB << ESP32_REG_SHIFT(SPI_USER2, COMMAND_VALUE));
            }
        } else {
            if (quadMode) {
                ESP32_SPI1_REG(USER2) = (0x7 << ESP32_REG_SHIFT(SPI_USER2, COMMAND_BITLEN)) | s_pChipCommands->FRQO;
            } else if (dualMode) {
                ESP32_SPI1_REG(USER2) = (0x7 << ESP32_REG_SHIFT(SPI_USER2, COMMAND_BITLEN)) | s_pChipCommands->FRDO;
            } else {
                ESP32_SPI1_REG(USER2) = (0x7 << ESP32_REG_SHIFT(SPI_USER2, COMMAND_BITLEN)) | s_pChipCommands->FR;
            }
            ESP32_SPI1_REG(USER) |= ESP32_REG_MASK(SPI_USER, DUMMY);

            ESP32_SPI1_REG(USER1) = (ESP32_SPI1_REG(USER1) & ~ESP32_REG_MASK(SPI_USER1, ADDR_BITLEN)) |
                                                (SPI1_R_FAST_ADDR_BITSLEN << ESP32_REG_SHIFT(SPI_USER1, ADDR_BITLEN));
            ESP32_SPI1_REG(USER1) = (ESP32_SPI1_REG(USER1) & ~ESP32_REG_MASK(SPI_USER1, DUMMY_CYCLELEN)) |
                                                 ((SPI1_R_FAST_DUMMY_CYCLELEN + g_rom_spiflash_dummy_len_plus[1]) << ESP32_REG_SHIFT(SPI_USER1, DUMMY_CYCLELEN));
        }
    } else {
        ESP32_SPI1_REG(USER) &= ~ESP32_REG_MASK(SPI_USER, MOSI);
        if (g_rom_spiflash_dummy_len_plus[1] == 0) {
            ESP32_SPI1_REG(USER) &= ~ESP32_REG_MASK(SPI_USER, DUMMY);
        } else {
            ESP32_SPI1_REG(USER) |= ESP32_REG_MASK(SPI_USER, DUMMY);
            ESP32_SPI1_REG(USER1) = (ESP32_SPI1_REG(USER1) & ~ESP32_REG_MASK(SPI_USER1, DUMMY_CYCLELEN)) |
                                                 ((g_rom_spiflash_dummy_len_plus[1] - 1) << ESP32_REG_SHIFT(SPI_USER1, DUMMY_CYCLELEN));
        }
        ESP32_SPI1_REG(USER) |=  ESP32_REG_MASK(SPI_USER, MISO) | ESP32_REG_MASK(SPI_USER, ADDR);

        ESP32_SPI1_REG(USER1) = (ESP32_SPI1_REG(USER1) & ~ESP32_REG_MASK(SPI_USER1, ADDR_BITLEN)) |
                                                 (SPI1_R_SIO_ADDR_BITSLEN << ESP32_REG_SHIFT(SPI_USER1, ADDR_BITLEN));

        ESP32_SPI1_REG(USER2) = (0x7 << ESP32_REG_SHIFT(SPI_USER2, COMMAND_BITLEN)) | s_pChipCommands->RD;
    }

