rokudev/lt-sdk/lt/platforms/esp32/source/esp32/driver/flash/esp32/Esp32SPIFlash.c
    // now that the SPI bus is configured, read the data
    s32 sLen = len;
    while (sLen > 0) {
        ESP32_SPI1_REG(MISO_DLEN) = ((SPIFLASH_BUFF_BYTE_READ_NUM << 3) - 1) << ESP32_REG_SHIFT(SPI_MISO_DLEN, DBITLEN);
        ESP32_SPI1_REG(ADDR) = addr << 8;
        Esp32SPIFlash_RunCmd(s_pChipCommands->USR);

        for (u8 i = 0; i < (SPIFLASH_BUFF_BYTE_READ_NUM >> 2) && sLen > 0; ++i, pBuffer += 4) {
            u32 data = ESP32_SPI_W_REG(SPI1, i);
            u8 rem = LT_MIN((s32)sLen, (s32)sizeof(data));
            for (u32 n = 0; n < rem; ++n) {
                pBuffer[n] = ((u8 *)&data)[n];
            }
            sLen -= rem;
        }
        addr += SPIFLASH_BUFF_BYTE_READ_NUM;
    }

    Esp32SPIFlashCache_EnableCache(state);

    /* IRAM section end - Code from here on can run from flash */

    Esp32EnableInterrupts(mask);
}

/****************************************************************************
 * Returns whether flash encryption is enabled or not
 ****************************************************************************/
bool Esp32SPIFlash_IsEncryptionEnabled(void) {
    u32 crypt_cnt = ESP32_REG(EFUSE_BLK0_RDATA0) >> ESP32_REG_SHIFT(EFUSE, FLASH_CRYPT_CNT);
    crypt_cnt &= ESP32_REG_MASK(EFUSE, FLASH_CRYPT_CNT);
    // if crypt_cnt has an odd number of bits (odd parity), then encryption is enabled
    return __builtin_parity(crypt_cnt);
}

/****************************************************************************
 * Reads from the flash through the cache so data is decrypted if needed
 * (no alignment needed)
 ****************************************************************************/
bool ESP32_MEM_REGION(IRAM) Esp32SPIFlash_Read(u32 src, u8 * pBuffer, u32 size, bool bDecrypt) {
    if (bDecrypt && !Esp32SPIFlash_IsEncryptionEnabled()) {
        // can't decrypt
        return false;
    }

    // if no decryption is wanted and encryption is enabled, then bypass the cache and
    // read the data directly from the flash
    bool bReadDirect = !bDecrypt && Esp32SPIFlash_IsEncryptionEnabled();

    if (bReadDirect) {
        Esp32SPIFlash_ReadDirect(src, pBuffer, size);
    } else {
        Esp32SPIFlash_MapInfo map;
        map.srcAddr     = src;
        map.size        = size;

        u32 mask = Esp32DisableInterrupts();
        /* IRAM section begin - Code from here on must run from IRAM */
        u32 state = Esp32SPIFlashCache_DisableCache();

        // map the flash address so data is decrypted if it's encrypted
        Esp32SPIFlashCache_Mmap(&map);

        Esp32SPIFlashCache_EnableCache(state);
        /* IRAM section end - Code from here on can run from flash */
        Esp32EnableInterrupts(mask);

        if (map.ptr == NULL) {
            LTLOG_YELLOWALERT("fail.read.map", "Failed to map the flash");
        } else {
            // cache must be enabled before calling lt_memcpy()
            lt_memcpy(pBuffer, map.ptr, size);

            mask = Esp32DisableInterrupts();
            /* IRAM section begin - Code from here on must run from IRAM */
            state = Esp32SPIFlashCache_DisableCache();

            Esp32SPIFlashCache_Ummap(&map);

            Esp32SPIFlashCache_EnableCache(state);
            /* IRAM section end - Code from here on can run from flash */
            Esp32EnableInterrupts(mask);
        }
    }

    return true;
}

/****************************************************************************
 * Write data to Flash (no alignment needed)
 ****************************************************************************/
bool ESP32_MEM_REGION(IRAM) Esp32SPIFlash_Write(u32 addr, const u8 * pBuffer, u32 size, bool bEncrypt) {
    if (bEncrypt && !Esp32SPIFlash_IsEncryptionEnabled()) {
        LTLOG_YELLOWALERT("enc.disabled", "bEncrypt is set, but encryption is not enabled");
        return false;
    }

    if (bEncrypt && ((addr & 0x1f) || (size & 0xf))) {
        LTLOG_YELLOWALERT("invalid.enc.align", "Encryption data size must be 16-byte aligned and address must be 32-byte aligned");
        return false;
    }

    bool bSuccess = true;
    if (addr & 0x3) {
        // address is not aligned, read prev aligned word
        u32 wordBuff        = LT_U32_MAX;
        u32 nonAlignedAddr  = addr;
        // align the address
        addr &= ~0x3;
        // read an aligned word
        Esp32SPIFlash_Read(addr, (u8 *)&wordBuff, sizeof(wordBuff), bEncrypt);
        // offset into the read word to write non-aligned data to
        u8 wordOffset = nonAlignedAddr - addr;
        // size to write into the read word
        u32 rem = sizeof(wordBuff) - wordOffset;
        u8 * wordPtr = (u8 *)&wordBuff;
        // copy at the offset and size
        lt_memcpy(wordPtr + wordOffset, pBuffer, LT_MIN(rem, size));
        if (bEncrypt) {
            // shouldn't get here
            bSuccess = false;
            LT_ASSERT(false);
        } else {
            bSuccess = Esp32SPIFlash_WritePriv(addr, (u8 *)&wordBuff, sizeof(wordBuff));
        }
        size    -= LT_MIN(rem, size);
        addr    += sizeof(wordBuff);
        pBuffer += rem;
    }
    if (bSuccess && size > 0) {
        u32 lenWords = size & ~0x3;
        if (lenWords > 0) {
            if (bEncrypt) {
                bSuccess = Esp32SPIFlash_WriteEncrypted(addr, pBuffer, lenWords);
            } else {
                bSuccess = Esp32SPIFlash_WritePriv(addr, pBuffer, lenWords);
            }
            pBuffer += lenWords;
            addr    += lenWords;
            size     = (size < lenWords ? 0 : size - lenWords);
        }

        // if there is some remaining, we need to write the last word
        if (size > 0 && bSuccess) {
            u32 wordBuff = 0;
            Esp32SPIFlash_Read(addr, (u8 *)&wordBuff, sizeof(wordBuff), bEncrypt);
            lt_memcpy(&wordBuff, pBuffer, size);
            if (bEncrypt) {
                // shouldn't get here
                bSuccess = false;
                LT_ASSERT(false);
            } else {
                bSuccess = Esp32SPIFlash_WritePriv(addr, (u8 *)&wordBuff, sizeof(wordBuff));
            }
        }
    }

    return bSuccess;
}

/*******************************************************************************
 *  LOG
 *******************************************************************************
 *  25-May-22   vitellius   created
 *  25-May-22   vitellius   Functions were modified and fixed by Roku LT
 */
